tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Platform built on V8 to build network applications
brew "node"
# Display and control your Android device
brew "scrcpy"
# Cross-shell prompt for astronauts
brew "starship"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Archive manager for data compression and backups
cask "rar"
# Open-source code editor
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "chouzz.vscode-better-align"
vscode "dart-code.flutter"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "redhat.vscode-xml"
vscode "ritwickdey.liveserver"
vscode "sdras.night-owl"
