tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "aws-sam-cli"
brew "docutils"
brew "awscli"
brew "bat"
brew "cocoapods"
brew "coreutils"
brew "csvkit"
brew "fd"
brew "gh"
brew "git"
brew "gnutls"
brew "go"
brew "harfbuzz"
brew "jq"
brew "pango"
brew "librsvg"
brew "lsd"
brew "mackup"
brew "node"
brew "php"
brew "postgresql@14", restart_service: true
brew "postgis"
brew "ripgrep"
brew "serverless"
brew "starship"
brew "vim"
brew "wget"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@28"
cask "adoptopenjdk8"
cask "android-commandlinetools"
cask "cerebro"
cask "cleanmymac"
cask "deepl"
cask "docker"
cask "flutter"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "insomnia"
cask "iterm2"
cask "karabiner-elements"
cask "keepassxc"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "pgadmin4"
cask "postman"
cask "rar"
cask "temurin"
cask "temurin11"
cask "temurin8"
cask "visual-studio-code"
